tutorials/multicomponentFluid/shearlayer_DLB_pyJac/0.orig/NC12H26
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | DLBFoam: Dynamic Load Balancing                 |
|  \\    /   O peration     | for fast reactive simulations                   |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  | 2020, Aalto University, Finland                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      NC12H26;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField  #codeStream
{

    code
    #{

        const IOdictionary& d = static_cast<const IOdictionary&>(dict);
        const fvMesh& mesh = refCast<const fvMesh>(d.db());
        const vectorField& CC = mesh.C(); //cell center


        scalarField NC12H26(mesh.nCells());
        scalar NC12H26_i = 0.0;

        scalar A = 1;
        scalar L = 0.008;
        scalar ro = 0.0004;
        scalar B = 5;



        forAll(CC,cellI)
        {

        	scalar y = CC[cellI].y();

            NC12H26[cellI] = NC12H26_i + A * 0.5 * (1-tanh(B*(mag(y-L/2)/ro - ro/mag(y-L/2))));

        }

        writeEntry(os,"",NC12H26);
    #};

    //! Optional:
    codeInclude
    #{
        #include "volFields.H"
    #};


    codeOptions
    #{

        -I$(LIB_SRC)/finiteVolume/lnInclude \
        -I$(LIB_SRC)/meshTools/lnInclude

    #};


    //! libs:

    codeLibs
    #{
        -lmeshTools \
        -lfiniteVolume
    #};

};
boundaryField
{
    upperBoundary
    {
        type            cyclic;
    }

    lowerBoundary
    {
        type            cyclic;
    }

    leftBoundary
    {
        type            cyclic;
    }

    rightBoundary
    {
        type            cyclic;
    }

    frontAndBack
    {
        type            empty;
    }

}


// ************************************************************************* //
